nimsara1999/gas_sensor_ble_esp32/src/main.cpp
// Firmware version: S3 1.0.1

#include <WiFi.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEScan.h>
#include <BLEAdvertisedDevice.h>
#include <NTPClient.h>
#include <WiFiUdp.h>
#include <ESP32httpUpdate.h>
#include <ArduinoJson.h>
#include <WiFiClientSecure.h>
#include <Adafruit_NeoPixel.h>
#include <esp_task_wdt.h>

#define LED_PIN 48
#define NUM_PIXELS 1
#define WDT_TIMEOUT 20 // Watchdog Timeout in seconds

bool inAPMode = false;
bool bluetooth_sending_status = false;
bool inSensorSearchingMode = false;
unsigned long previousMillis = 0;
unsigned long previousMillisForAPMode = 0;
unsigned long previousMillisForUpdateCheck = 0;
int led_state = 0;
int number_of_failed_attempts_to_connect_to_server = 0;
int max_number_of_failed_attempts = 4;
int updateCheckTimer = 0;
bool automatically_put_to_AP_mode = false;

String tankSize = "NA";
String timeZone = "NA";
String longitude = "NA";
String latitude = "NA";
String loadedHeight = "NA";
String gatewayName = "NA";
String selected_sensor_mac_address = "NA";
String current_fw_version = "NA";
String CHIPID = "123456";
String ap_ssid = "Gateway";
String postData;

const int scanTimeSeconds = 1;
const int BOOT_PIN = 0;
const int SSID_ADDR = 0;
const int PASS_ADDR = 50;
const int TANKSIZE_ADDR = 100;
const int TIMEZONE_ADDR = 150;
const int LONGITUDE_ADDR = 200;
const int LATITUDE_ADDR = 250;
const int LOADED_HEIGHT_ADDR = 300;
const int SENSOR_MAC_ADDR = 350;
const int FW_VERSION_ADDR = 400;
const int GATEWAY_NAME_ADDR = 450;
const int EEPROM_SIZE = 512;
const int LED_brightness = 70;
const int httpsPort = 443;
const int sound_speed = 757;
const long blink_interval = 500;          // Blink interval in milliseconds
const long fw_update_interval = 60000;    // Firmware update check interval in milliseconds
const long wifi_search_interval = 120000; // Wi-Fi search interval in milliseconds
const char *ap_password = "123456789";
const char *serverHost = "elysiumapi.overleap.lk";
const char *apiPath = "/api/v2/gas/stream/esp32_que"; // API endpoint

static char apSsidBuffer[50];
static unsigned long lastSendTime = 0;

BLEScan *pBLEScan;

WebServer server(80);
WiFiClientSecure client;

WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", 19800, 60000);

Adafruit_NeoPixel strip(NUM_PIXELS, LED_PIN, NEO_GRB + NEO_KHZ800);

void indicateSuccessfulConnection();
void indicateUnsuccessfulConnection();
void indicateGatewayStart();
void indicateReadyToReceiveData();
bool tryConnectToSavedWiFi();
void doUpdate(const String &new_fw_version, const String &old_fw_version);
void check_for_fw_updates(int interval);
bool handleButtonPress();
void blinkRGBLedInPattern(int numTimes, int red, int green, int blue, int onTime1, int offTime1, int onTime2 = 0, int offTime2 = 0);

std::string string_to_hex(const std::string &input)
{
  static const char hex_digits[] = "0123456789abcdef";
  std::string output;
  output.reserve(input.length() * 2);
  for (unsigned char c : input)
  {
    output.push_back(hex_digits[c >> 4]);
    output.push_back(hex_digits[c & 15]);
  }
  return output;
}

std::string format_hex_string(const std::string &hexString)
{
  std::string formattedString;
  for (size_t i = 0; i < hexString.length(); i += 2)
  {
    formattedString += hexString.substr(i, 2);
    if (i + 2 < hexString.length())
    {
      formattedString += " ";
    }
  }
  return formattedString;
}

int hex_to_int(const std::string &hexString)
{
  return strtol(hexString.c_str(), nullptr, 16);
}

// Function to blink the LED in a specific RGB pattern
void blinkRGBLedInPattern(int numTimes, int red, int green, int blue, int onTime1, int offTime1, int onTime2, int offTime2)
{
  for (int i = 0; i < numTimes; i++)
  {
    // strip.setPixelColor(0, strip.Color(red, green, blue));
    // strip.show();
    delay(onTime1);
    // strip.setPixelColor(0, strip.Color(0, 0, 0));
    // strip.show();
    delay(offTime1);

    if (onTime2 > 0 || offTime2 > 0)
    {
      // strip.setPixelColor(0, strip.Color(red, green, blue));
      strip.show();
      delay(onTime2);
      // strip.setPixelColor(0, strip.Color(0, 0, 0));
      // strip.show();
      delay(offTime2);
    }
  }
}

void sendDataToServer(void *param)
{
  Serial.println("\n****************************************************************************************************");

  if (client.connect("www.google.com", 443))
  {
    Serial.println("Internet connection: OK");
  }
  else
  {
    Serial.println("Internet connection: FAILED!!!!!");
  }
  client.stop();

  if (client.connect(serverHost, httpsPort))
  {
    Serial.println("Connected to server. Sending data... ");
    Serial.println("JSON Data:");
    Serial.println(postData);

    client.println(String("POST ") + apiPath + " HTTP/1.1");
    client.println(String("Host: ") + serverHost);
    client.println("Content-Type: application/json");
    client.print("Content-Length: ");
    client.println(postData.length());
    client.println();
    client.println(postData);

    unsigned long timeout = millis();
    bool isHeader = true;
    int responseCode = -1;
    String responseBody = "";

    int freeHeap = ESP.getFreeHeap();
    Serial.println("Free heap memory: " + String(freeHeap));

    if (freeHeap < 20000)
    {
      Serial.println("Free heap memory is low. Restarting ESP");
      // blinkRGBLedInPattern(8, LED_brightness, 0, 0, 100, 100); // blink red LED short pulses
      ESP.restart();
    }

    while (client.connected() && (millis() - timeout) < 5000)
    {
      String response = client.readString();
      responseCode = response.substring(9, 12).toInt();
      Serial.print("Server responseCode: ");
      Serial.println(responseCode);
      if (responseCode == 200)
      {
        Serial.println("Data sent successfully");
        // blinkRGBLedInPattern(1, 0, LED_brightness, 0, 30, 30, 60, 0); // blink green LED short pulses
        esp_task_wdt_reset();
        number_of_failed_attempts_to_connect_to_server = 0;
        break;
      }
    }
    client.stop();
  }
  else
  {
    Serial.println("Connection to server failed");
    // blinkRGBLedInPattern(1, LED_brightness, 0, 0, 30, 30, 60, 0); // blink red LED short pulses
    number_of_failed_attempts_to_connect_to_server++;
    Serial.println("Number of failed attempts: " + String(number_of_failed_attempts_to_connect_to_server));
    if (number_of_failed_attempts_to_connect_to_server >= max_number_of_failed_attempts)
    {
      Serial.println("Restarting ESP");
      // blinkRGBLedInPattern(max_number_of_failed_attempts, LED_brightness, 0, 0, 400, 200); // blink red LED long pulses for max_number_of_failed_attempts
      ESP.restart();
    }
  }

  vTaskDelete(NULL);
}

void createHTTPSTask()
{
  xTaskCreate(
      sendDataToServer, // Task function
      "HTTPS Task",     // Task name
      8192,             // Stack size
      NULL,             // Task input parameter
      1,                // Priority
      NULL              // Task handle
  );
}

class AdvertisedDeviceCallbacks : public BLEAdvertisedDeviceCallbacks
{

  void onResult(BLEAdvertisedDevice advertisedDevice)
  {
    if (strcmp(advertisedDevice.getName().c_str(), "") == 0)
    {
      std::string hexAdvData = string_to_hex(advertisedDevice.getManufacturerData());
      if (hexAdvData.rfind("544e", 0) == 0) // Check for a valid prefix
      {
        std::string frameHead1 = hexAdvData.substr(0, 4);
        std::string type = hexAdvData.substr(4, 2);
        std::string cmd = hexAdvData.substr(6, 2);
        std::string frameHead2 = hexAdvData.substr(8, 4);
        std::string measurementHex = hexAdvData.substr(12, 4);
        std::string batteryHex = hexAdvData.substr(16, 2);
        std::string macAddress = advertisedDevice.getAddress().toString().c_str();

