nimsara1999/gas_sensor_ble_esp32/src/main.cpp
    tankSize = doc["tankSize"].as<String>();
    timeZone = doc["timeZone"].as<String>();
    longitude = doc["longitude"].as<String>();
    latitude = doc["latitude"].as<String>();
    loadedHeight = doc["loadedHeight"].as<String>();
    gatewayName = doc["gatewayName"].as<String>();

    Serial.print("Received TankSize: ");
    Serial.print(tankSize);
    Serial.print("\tTimeZone: ");
    Serial.print(timeZone);
    Serial.print("\tLongitude: ");
    Serial.print(longitude);
    Serial.print("\tLatitude: ");
    Serial.println(latitude);
    Serial.print("\tLoaded Height: ");
    Serial.println(loadedHeight);
    Serial.print("\tGateway Name: ");
    Serial.println(gatewayName);

    server.send(200, "application/json", "{\"status\": 1}");

    saveOtherConfigDataToEEPROM(tankSize, timeZone, longitude, latitude, loadedHeight, gatewayName);
    Serial.println("Restart the gateway to start sending data to the server");
  }
  else
  {
    server.send(405, "text/plain", "Method Not Allowed");
  }
}

void handle_connect_to_new_wifi()
{
  if (server.method() == HTTP_POST)
  {
    esp_task_wdt_reset();
    JsonDocument doc;

    String requestBody = server.arg("plain");
    DeserializationError error = deserializeJson(doc, requestBody);

    if (error)
    {
      Serial.print("JSON parse error: ");
      Serial.println(error.c_str());
      server.send(400, "text/plain", "Invalid JSON");
      return;
    }

    String ssid = doc["ssid"].as<String>();
    String password = doc["password"].as<String>();

    Serial.println("\nReceiving Wi-Fi credentials...");
    Serial.print("Received SSID: ");
    Serial.println(ssid);

    Serial.print("Trying to connect to the new Wi-Fi network");

    WiFi.mode(WIFI_AP_STA);
    WiFi.begin(ssid.c_str(), password.c_str());

    int maxRetries = 10;
    int retries = 0;

    while (WiFi.status() != WL_CONNECTED && retries < maxRetries)
    {
      delay(1000);
      Serial.print(".");
      retries++;
    }

    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("\nSuccessfully connected to Wi-Fi");
      server.send(200, "application/json", "{\"status\": 1, \"ssid\": \"" + ssid + "\"}");

      delay(1000);

      saveWiFiCredentials(ssid, password);
      Serial.print("Wi-Fi client IP Address: ");
      Serial.println(WiFi.localIP());
      Serial.print("Wi-Fi server (AP) IP Address: ");
      Serial.println(WiFi.softAPIP());

      indicateSuccessfulConnection();
    }
    else
    {
      Serial.println("\nFailed to connect to Wi-Fi");
      server.send(200, "application/json", "{\"status\": 0, \"ssid\": \"" + ssid + "\"}");
      WiFi.mode(WIFI_AP);
      WiFi.softAP(ap_ssid, ap_password);
      Serial.println("Re-enabled AP mode");
    }
  }
  else
  {
    server.send(405, "text/plain", "Method Not Allowed");
  }
}

void handle_sync_sensor()
{
  if (server.method() == HTTP_GET)
  {
    esp_task_wdt_reset();
    Serial.println("\nWaiting for user to press SYNC button on sensor...");
    // blinkRGBLedInPattern(3, LED_brightness, 0, LED_brightness, 50, 50); // blink 3 purple LED short pulses
    inSensorSearchingMode = true;
    selected_sensor_mac_address = "NA";
    while (inSensorSearchingMode && inAPMode)
    {
      BLEScanResults foundDevices = pBLEScan->start(scanTimeSeconds, false);
      pBLEScan->clearResults();
      if (selected_sensor_mac_address != "NA")
      {
        server.send(200, "application/json", "{\"status\": 1, \"sync_mac\": \"" + selected_sensor_mac_address + "\"}");
        Serial.println("SYNCed sensor mac sent to the app");
        // blinkRGBLedInPattern(2, LED_brightness, 0, LED_brightness, 100, 100); // blink 2 purple LED short pulses
        inSensorSearchingMode = false;
        break;
      }
    }
  }
}

void handle_confirm_synced_sensor()
{
  if (server.method() == HTTP_GET)
  {
    if (selected_sensor_mac_address != "NA")
    {
      esp_task_wdt_reset();
      Serial.println("Confirmed synced sensor. Writing to EEPROM...");
      bluetooth_sending_status = false;
      EEPROM.begin(EEPROM_SIZE);
      for (int i = SENSOR_MAC_ADDR; i < SENSOR_MAC_ADDR + 50; i++)
        EEPROM.write(i, 0);
      for (int i = 0; i < selected_sensor_mac_address.length(); i++)
        EEPROM.write(SENSOR_MAC_ADDR + i, selected_sensor_mac_address[i]);
      EEPROM.commit();
      // blinkRGBLedInPattern(1, 0, LED_brightness, LED_brightness, 1000, 10); // cyan LED single long pulse
      // blinkRGBLedInPattern(1, 0, LED_brightness, 0, 50, 50, 100, 100);      // green LED two short pulses
      Serial.println("Saved mac address of the sensor to the EEPROM");
      server.send(200, "application/json", "{\"status\": 1, \"confirmed_mac\": \"" + selected_sensor_mac_address + "\"}");
    }
  }
}

void check_for_fw_updates(int interval)
{
  unsigned long currentMillis = millis();
  if (currentMillis - previousMillisForUpdateCheck >= interval)
  {

    Serial.println("\n******************FW UPDATE CHECK******************");

    if (client.connect("www.google.com", 443))
    {
      Serial.println("Internet connection: OK");
      client.stop();
    }
    else
    {
      Serial.println("Internet connection: FAILED!\nUpdate check failed");
      client.stop();
      blinkRGBLedInPattern(2, LED_brightness, 0, 0, 30, 30); // 2 red LED short pulses
      return;
    }

    previousMillisForUpdateCheck = currentMillis;
    HTTPClient http;
    String serverName = "https://raw.githubusercontent.com/nimsara1999/OTAupdate/refs/heads/main/check.txt";
    http.begin(serverName);

    // Send HTTP GET request
    int httpResponseCode = http.GET();
    if (httpResponseCode > 0)
    {
      String payload = http.getString();
      payload.trim();
      Serial.print("Current firmware version: ");
      Serial.print(current_fw_version);
      Serial.print("\tLatest firmware version: ");
      Serial.println(payload);
      http.end();

