nimsara1999/gas_sensor_ble_esp32/src/main.cpp
      if (payload == current_fw_version)
      {
        Serial.println("Firmware update check done. No new updates available");
        blinkRGBLedInPattern(1, LED_brightness, LED_brightness, 0, 400, 5); // yellow LED single long pulse
        blinkRGBLedInPattern(1, 0, LED_brightness, 0, 70, 100);             // green LED single long pulse
      }
      else
      {
        Serial.println("Firmware update check done. New updates available. Initiating firmware update in 5 seconds...");
        blinkRGBLedInPattern(5, LED_brightness, LED_brightness, 0, 800, 200); // 5 yellow LED long pulses
        doUpdate(payload, current_fw_version);
      }
    }
    else
    {
      Serial.print("Update check error. Error code: ");
      Serial.println(httpResponseCode);
    }
  }
}

// updating firmware fetching latest firmware bin file from server
void doUpdate(const String &new_fw_version, const String &old_fw_version)
{
  strip.setPixelColor(0, strip.Color(LED_brightness, LED_brightness, 0));
  strip.show();

  Serial.println("Fetching Update...");
  String url = "https://raw.githubusercontent.com/nimsara1999/OTAupdate/refs/heads/main/firmware.bin";

  saveFwVersion(new_fw_version);

  t_httpUpdate_return ret = ESPhttpUpdate.update(url);

  switch (ret)
  {
  case HTTP_UPDATE_FAILED:
    Serial.println("Update failed!");
    saveFwVersion(old_fw_version);
    blinkRGBLedInPattern(1, 0, 0, 0, 30, 30, 200, 5);        // LED off
    blinkRGBLedInPattern(3, LED_brightness, 0, 0, 300, 300); // 3 red LED short pulses
    break;
  case HTTP_UPDATE_NO_UPDATES:
    Serial.println("No new update available");
    saveFwVersion(old_fw_version);
    break;
  // We can't see this, because of reset chip after update OK
  case HTTP_UPDATE_OK:
    Serial.println("Update OK");
    break;

  default:
    break;
  }
}

bool isValidString(String data, size_t maxLength)
{
  if (data.isEmpty())
  {
    return false;
  }
  if (data.length() == 0 || data.length() > maxLength)
  {
    return false;
  }
  for (size_t i = 0; i < data.length(); i++)
  {
    char c = data.charAt(i);
    if (c < 32 || c > 126)
    {
      return false; // Invalid character found
    }
  }
  return true; // String is valid
}

void setup()
{
  Serial.begin(115200);

  esp_task_wdt_init(WDT_TIMEOUT, true); // timeout, true to trigger a reset
  esp_task_wdt_add(NULL);               // Add the current task to the WDT

  strip.begin(); // Initialize the LED
  strip.show();  // Turn off all LEDs

  pinMode(BOOT_PIN, INPUT_PULLUP);

  Serial.println("\n\nStarting Gateway...\n");
  indicateGatewayStart(); // blink white, cyan, magenta, yellow, white short pulses

  // Get the MAC address
  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  char macStr[13];
  snprintf(macStr, sizeof(macStr), "%02X%02X%02X", mac[3], mac[4], mac[5]);
  ap_ssid += "-";
  ap_ssid += macStr;

  Serial.print("AP SSID: ");
  Serial.println(ap_ssid);
  Serial.println("");

  EEPROM.begin(EEPROM_SIZE);

  server.on("/configuration/v1/wifi-config", HTTP_POST, handle_connect_to_new_wifi);
  server.on("/configuration/v1/other-config", HTTP_POST, handle_other_config);
  server.on("/check/v1/check-internet", HTTP_GET, handle_check_internet_connection);
  server.on("/check/v1/confirm-synced-sensor", HTTP_GET, handle_confirm_synced_sensor);
  server.on("/check/v1/sync-sensor", HTTP_GET, handle_sync_sensor);
  server.on("/made-by", []()
            { server.send(200, "text/plain", "Made by Nimsara & Sasindu."); });

  bluetooth_sending_status = false;
  client.setInsecure(); // For development purposes, skip certificate validation

  // Try to connect to saved Wi-Fi credentials and load other configuration data
  if (!tryConnectToSavedWiFi() || timeZone == "NA" || tankSize == "NA" || longitude == "NA" || latitude == "NA" || loadedHeight == "NA" || selected_sensor_mac_address == "NA" || gatewayName == "NA")
  {
    if (!handleButtonPress())
    {
      Serial.println("Automatically starting AP mode");
      blinkRGBLedInPattern(3, 0, 0, LED_brightness, 30, 50); // blink blue LED short pulses for 3 times
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(ap_ssid, ap_password);
      Serial.println("Access Point Started");
      Serial.print("AP IP Address: ");
      Serial.println(WiFi.softAPIP());
      automatically_put_to_AP_mode = true;
      inAPMode = true;
    }
  }
  else
  {
    inAPMode = false;
    WiFi.mode(WIFI_STA);
    indicateSuccessfulConnection();
    if (isValidString(timeZone, 50) && isValidString(tankSize, 50) && isValidString(longitude, 50) && isValidString(latitude, 50) && isValidString(loadedHeight, 50) && isValidString(gatewayName, 50))
    {
      bluetooth_sending_status = true;
      Serial.println("Data loaded from EEPROM.");
      Serial.print("Gateway Name: ");
      Serial.println(gatewayName);
      Serial.print("Firmware Version: ");
      Serial.println(current_fw_version);
      check_for_fw_updates(0);
      indicateReadyToReceiveData();
      Serial.println("\nScanning for Gas sensor of MAC address: " + selected_sensor_mac_address);
    }
    else
    {
      Serial.println("Invalid data loaded from EEPROM. Restarting the gateway");
      while (1)
      {
        delay(100);
        blinkRGBLedInPattern(1, LED_brightness, 0, 0, 100, 200); // blink red LED short pulses
        if (handleButtonPress())
        {
          break;
        }
      }
    }
  }

  server.begin();

  timeClient.begin();

  BLEDevice::init("");
  pBLEScan = BLEDevice::getScan();
  pBLEScan->setAdvertisedDeviceCallbacks(new AdvertisedDeviceCallbacks());
  pBLEScan->setActiveScan(false);
  pBLEScan->setInterval(100);
  pBLEScan->setWindow(99);
}

void loop()
{
  esp_task_wdt_reset();
  server.handleClient();

  if (inAPMode)
  {
    blinkLEDInAPMode();
  }
  else
  {
    check_for_fw_updates(fw_update_interval);
    handleButtonPress();
    BLEScanResults foundDevices = pBLEScan->start(scanTimeSeconds, false);
    pBLEScan->clearResults();
  }
}
